app/controllers/messages_controller.rb

  def create
    @message = @group.messages.new(message_params)
    if @message.save
---
INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('Rerum fuga perferendis ipsa asperiores.', 9, 9, '2018-03-18 05:52:55', '2018-03-18 05:52:55', NULL)

  def set_group
    @group = Group.find(params[:group_id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 9 LIMIT 1